print("walcome to BoB Maket","\nThis is categoery\n\n","สมัคร Netflix ----------------------> กด 1\n สมัคร Disney+ ----------------------> กด 2\n สมัคร Prime Video ------------------> กด 3\n สมัคร HBO Go -----------------------> กด 4")

shopdic = {
    "1" : "     -----Netflix-----\n 7 day --------------> 34 บาท --->กด 1\n 30 day -------------> 94 บาท --->กด 2\n 60 day -------------> 174 บาท  --->กด 3",
    "2" : "      -----Disney+-----\n 7 day --------------> 29 บาท --->กด 1\n 30 day -------------> 79 บาท --->กด 2\n 60 day -------------> 161 บาท --->กด 3",
    "3" : "       -----Prime-----\n 7 day --------------> 13 บาท --->กด 1\n 30 day -------------> 34 บาท --->กด 2\n 60 day -------------> 80 บาท --->กด 3",
    "4" : "       -----HBO Go-----\n 7 day --------------> 20 บาท --->กด 1\n 30 day -------------> 45 บาท --->กด 2\n 60 day -------------> 80 บาท --->กด 3"
    
    
}

netdic = {
    "1" : "7 day --------------> ยอด 34 บาท โอนจ่าย 0958620453",
    "2" : "30 day -------------> ยอด 94 บาท โอนจ่าย 0958620453",
    "3" : "60 day -------------> ยอด 174 บาท โอนจ่าย 0958620453"
}

disdic = {
    "1" : "7 day --------------> ยอด 29 บาท โอนจ่าย 0958620453",
    "2" : "30 day -------------> ยอด 79 บาท โอนจ่าย 0958620453",
    "3" : "60 day -------------> ยอด 161 บาท โอนจ่าย 0958620453"
}

primedic = {
    "1" : "7 day --------------> ยอด 13 บาท โอนจ่าย 0958620453",
    "2" : "30 day -------------> ยอด 34 บาท โอนจ่าย 0958620453",
    "3" : "60 day -------------> ยอด 80 บาท โอนจ่าย 0958620453"
}

hbodic = {
    "1" : "7 day --------------> ยอด 20 บาท โอนจ่าย 0958620453",
    "2" : "30 day -------------> ยอด 45 บาท โอนจ่าย 0958620453",
    "3" : "60 day -------------> ยอด 80 บาท โอนจ่าย 0958620453"
}

choose = int(input("กดเลือกบริการที่ท่านต้องการ ---------->"))
s1 = shopdic["1"]
if choose == 1:
    print(s1)

s2 = shopdic["2"]
if choose == 2:
    print(s2)

s3 = shopdic["3"]
if choose == 3:
    print(s3)

s4 = shopdic["4"]
if choose == 4:
    print(s4)

net = input("กดเลือกแพ๊คที่ท่านต้องการ ---------->")
n1 = netdic["1"]
if net == 1:
    print(n1,"\n------ขอบคุณที่ใช้บริการครับ------")

n2 = netdic["2"]
if net == 2:
    print(n2,"\n------ขอบคุณที่ใช้บริการครับ------")

n3 = netdic["3"]
if net == 3:
    print(n3,"\n------ขอบคุณที่ใช้บริการครับ------")


d1 = disdic["1"]
if net == d1:
    print(d1,"\n------ขอบคุณที่ใช้บริการครับ------")

d2 = disdic["2"]
if net == d2:
    print(d2,"\n------ขอบคุณที่ใช้บริการครับ------")

d3 = disdic["3"]
if net == d3:
    print(d3,"\n------ขอบคุณที่ใช้บริการครับ------")



p1 = primedic["1"]
if net == p1:
    print(p1,"\n------ขอบคุณที่ใช้บริการครับ------")

p2 = primedic["2"]
if net == p2:
    print(p2,"\n------ขอบคุณที่ใช้บริการครับ------")


p3 = primedic["3"]
if net == p3:
    print(p3,"\n------ขอบคุณที่ใช้บริการครับ------")


h1 = hbodic["1"]
if net == hbo1:
    print(h1,"\n------ขอบคุณที่ใช้บริการครับ------")


h2 = hbodic["2"]
if net == hbo2:
    print(h2,"\n------ขอบคุณที่ใช้บริการครับ------")

h3 = hbodic["3"]
if net == hbo3:
    print(h3,"\n------ขอบคุณที่ใช้บริการครับ------")
