print ("สวัสดีครับ นี่คือโปรเน็นของ ตะดอบอินเตอร์เน็ต 5g","\n*****************************","\nโปรโทร กด 1","\nโปรเน็ต กด 2")
x = int(input("เลือกกด ประเภทแพ๊คที่ท่านใช้ : "))
if x == 1:
    print("--------------------","\nเลือกโทร","\nโทร 18 นาที 1 วัน ----------> กด 1 ","\nโทร 60 นาที 1 วัน ----------> กด 2","\nโทร 60 นาที 1 วัน ----------> กด 3")
    y = int(input("เลือกแพ๊คที่ต้องการ : "))
    if y == 1: 
        print("ยอดทั้งหมด 9 บาท")
    elif y == 2:
        print("ยอดทั้งหมด 19 บาท")
    elif y == 3:
        print("ยอดทั้งหมด 20 บาท")
elif x == 2:
    print("--------------------","\nเลือกความเร็วเน็ต","ความเร็ว 384kbps --------> กด 1","\nความเร็ว 512kbps --------> กด 2","\nความเร็ว 4 mbps --------> กด 3")
    y = int(input("โปรดเลือกความเร็วเน็ตที่ท่านต้องการ : "))
    if y == 1:
        print ("โทรฟรีในเครือข่าย AIS ระหว่างเวลา 5:00-17:00 น. (ครั้งละไม่เกิน 60 นาที) พิเศษ ฟรี 10 SMS และ 5 MMS------->กด 1","\nโทรฟรีในเครือข่าย AIS ตลอด 24 ชม. (ครั้งละไม่เกิน 60 นาที)------->กด 2")
        z = int(input("โปรดเลือกการโทรที่ท่านต้องการ : "))
        if z == 1 :
            print("22 บาท 1 วัน")
        elif z == 2 :
            print("27 บาท 1 วัน")

    elif y == 2 :
        print("28 บาท 1 วัน")
    elif y == 3 :
        print("42 บาท 1 วัน")