a = []
while True: 
    b = input('---- ชาบู หมีน้อย----\n เพิ่ม [a]\n แสดง [s]\n ออกจากระบบ [x]\n')
    b = b.lower()
    if b == 'a' :
        c = input('ป้อนรายการลูกค้า(รหัส:ชื่อ:จังหวัด:เบอร์โทร)')
        a.append(c)
        print('\n******ข้อมูลได้เข้าสู่ระบบแล้ว******\n')
    elif b == 's' : 
        print('{0:-<6}{0:-<10}{0:-<10}'.format(" ")) #split
        print('{0:-<8}{1:-<10}{2:-<10}{3:-<10}'.format('รหัส','ชื่อ','จังหวัด','เบอร์โทร'))
        print('{0:-<6}{0:-<10}{0:-<10}'.format(" "))
        for d in a: 
            e = d.split(" ")
            print('{0[0]:<6} {0[1]:<10}{0[2]:<10}{0[3]:<10}'.format(e))
            continue
    elif b == 'x':
        break
print('ทำคำสั่งต่อไป')