List=[]
i=1

def index() : 
    print("โปรแกรมร้านค้าสินค้าออนไลน์","\n------------------------","\n1. แสดงรายการสินค้า","\n2. หยิบสินค้า","\n3. show","\n4. pick out","\n5. close ")
def one() :
    print("1.ยาดม\n2.น้ำเปล่า\n3.มาม่า")
def two() :
    print("1.ยาดม\n2.น้ำเปล่า\n3.มาม่า")
        info = input("ป้อนรายการลูกค้า (รหัสเบอร์คนนวดที่ท่านต้องการ : ชื่อคนนวดที่ท่านต้องการ : เบอร์สมาชิกของท่าน)  ")
        List.append(info)
        print("*********เพิ่มรายการเข้าสู่ระบบเรียบร้อย*********")
        print("----------------------")

while (True):
    x = int(input("เลือกทำรายการคือ : "))
    if x == 1 : 
        one()
    elif x == 2 : 
        two()
