List=[]
i=1
def st() :
    print("1.ยาดม\n2.น้ำเปล่า\n3.มาม่า\n4.สบู่\n5.แปรงสีฟัน")
def one() :
    st()
    info = input("ป้อนรายการสินค้า  ") 
    List.append(info)
    print("*********เพิ่มรายการเข้าสู่ระบบเรียบร้อย*********")
    print("----------------------")
    
def two() :
    for i in List:
        print(i)
    x = input("ป้อนรายการสินค้าที่ต้องการลบ  ")
    List.remove(x)
    print("*********ลบรายการเข้าสู่ระบบเรียบร้อย*********")
    print("----------------------")
def three() :
    print("สินค้า่ที่หยิบไปมีดังนี้")
    print("")
    for i in List:
        print(i)
    print("----------------------")


print('ร้านค้า','\n----------------------------')
while(True):
    x = int(input("\nเพิ่มรายการสินค้า [1]\nลบรายการสินค้า [2] \nแสดงข้อมูลสินค้าที่ท่านเลือก [3] \nออกจากระบบ [4] \n-----------------------\nเลือกอะไรจ๊ะเบบี๊ : "))
    if x == 1:
         one()
    if x == 2:
         two()
    if x == 3:
         three()
    if x == 4:
        y = input("ต้องการออกจากโปรแกรมหรือไม่? yes/no : ")
        print("---------------------------------Thank you -----------------------------------")
        if y =="yes":
            break
         